app/controllers/api/feeds_controller.rb

  def show
    render :json => Feed.find(params[:id]), include: :latest_entries
---
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = ? ORDER BY "entries"."updated_at" DESC  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    feed = current_user.feeds.find_or_create_by_url(feed_params[:url])
---
INSERT INTO "feeds" ("created_at", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?)
SELECT "feeds".* FROM "feeds" WHERE "feeds"."user_id" = ? AND "feeds"."url" = 'http://feeds.reuters.com/reuters/scienceNews' LIMIT 1  [["user_id", 2]]

  def destroy
    feed = current_user.feeds.find(params[:id])

    if feed.destroy
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."user_id" = ? AND "feeds"."id" = ? LIMIT 1  [["user_id", 2], ["id", "4"]]
DELETE FROM "feeds" WHERE "feeds"."id" = ?  [["id", 9]]